semestr1/logika/27.10.20-c.md

# Table of Contents

1.  [alternatywa łączna](#org6d0f27d)
2.  [alternatywa rozłączna](#orgcbd97e1)
3.  [dysjunkcja](#org1367f9b)
4.  [koniunkcja](#org948fe4d)
5.  [dysjunkcja](#org21c17bc)
6.  [implikacja](#org39fee45)
7.  [równoważność](#orgf299eac)
8.  [negacja](#orgf951f5f)



<a id="org6d0f27d"></a>

# alternatywa łączna

wypiję na przyjęciu wino lub piwo
zbiór potencjlnie wypitych napojów:
	{wino, piwo, wino i piwo}


<a id="orgcbd97e1"></a>

# alternatywa rozłączna

dokładnie jedno z dwojga
wypiję na przyjęciu wino albo piwo
zbiór potencjalnie wypitych napojów:
	{wino, piwo}


<a id="org1367f9b"></a>

# dysjunkcja

co najwyżej jedno z dwojga
wypiję na przyjęciu wino bądź piwo
zbiór potencjalnie wypitych napojów:
{wino, piwo, żaden}


<a id="org948fe4d"></a>

# koniunkcja

leon czyści rower i obmyśla plan zemsty
zdanie 1 (p) - leon czyści rower
zdanie 2 (q) - **leon** obmyśla plan zemsty
^ - i

i lecz oraz choć

p, q - czynniki koniunkcji

p ^ q - koniunkcja (czytamy "p i q")


<a id="org21c17bc"></a>

# dysjunkcja

p, q - człony alterntywy
p v q - dysjunkcja (czytamy "p albo q")


<a id="org39fee45"></a>

# implikacja

jeżeli leon czyści rower, to obmyśla plan zemsty

zdanie 1 (p) - leon czyści rower
zdanie 2 (q) - **leon** obmyśla plan zemsty
implikacja (→) - jeżeli .. to

p - poprzednik implikacji
q - następnik implikacji
p → q (czytamy "p implikuje q")


<a id="orgf299eac"></a>

# równoważność

leon czyści rower wtedy i tylko wtedy gdy obmyśla plan zemsty
zdanie 1 (p) - leon czyści rower
zdanie 2(q) - **leon** obmysla plan zemsty
równoważność (↔) - wtedy i tylko wtedy (wtw)

p, q strony równoważności
p ↔ q - czytamy równoważność p i q


<a id="orgf951f5f"></a>

# negacja

~p → ~q
**\***
błędy:

-   2 zmienne zdaniowe nieoddzielone stałą logiczną
-   nigdy nie mogą występować 2 stałe logiczne nieoddzielone zmienną zdaniową (nie dotyczy negacji)
-   negacja nie łączy dwóch zdań, lecz łączy się tylko z jednym

**\***
światło ma naturę korpuskularną zawsze i tylko wtedy gdy nieprawda że ma naturę falową

zdanie 1 (p) - śwatło ma naturę korpuskulrną
zdanie 2 (q) - **światło** ma naturę falową
negacja - nieprawda że
**\***
jeżeli byłeś w paryżu to zwiedziłeś luwr i widziałeś wieżę Eiffel'a

p → (q ^ r)
**\***
jeżeli historia tlumazcy zdarzenia minione i pozwala przewidywać przyszlość to jest nauką x

**\***
jeżeli mówisz nieprawde to mylisz sie lub kłamiesz

